## Dataset

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
from sklearn.model_selection import train_test_split

In [3]:
dataset = "Adult"
ds_model = "Real_training"

In [4]:
real_dir = os.path.join("../../dataset")
real_path = os.path.join(real_dir,"adult.csv")

In [5]:
dataset = pd.read_csv(real_path, sep=",")
dataset.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [6]:
dataset.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [7]:
dataset.shape

(48842, 15)

In [8]:
dataset.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [9]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [10]:
for column in dataset.columns:
    print(f"* {column}: {dataset[column].unique()} \n")

* age: [25 38 28 44 18 34 29 63 24 55 65 36 26 58 48 43 20 37 40 72 45 22 23 54
 32 46 56 17 39 52 21 42 33 30 47 41 19 69 50 31 59 49 51 27 57 61 64 79
 73 53 77 80 62 35 68 66 75 60 67 71 70 90 81 74 78 82 83 85 76 84 89 88
 87 86]

* workclass: ['Private' 'Local-gov' '?' 'Self-emp-not-inc' 'Federal-gov' 'State-gov'
 'Self-emp-inc' 'Without-pay' 'Never-worked']

* fnlwgt: [226802  89814 336951 ... 129912 255835 257302]

* education: ['11th' 'HS-grad' 'Assoc-acdm' 'Some-college' '10th' 'Prof-school'
 '7th-8th' 'Bachelors' 'Masters' 'Doctorate' '5th-6th' 'Assoc-voc' '9th'
 '12th' '1st-4th' 'Preschool']

* educational-num: [ 7  9 12 10  6 15  4 13 14 16  3 11  5  8  2  1]

* marital-status: ['Never-married' 'Married-civ-spouse' 'Widowed' 'Divorced' 'Separated'
 'Married-spouse-absent' 'Married-AF-spouse']

* occupation: ['Machine-op-inspct' 'Farming-fishing' 'Protective-serv' '?'
 'Other-service' 'Prof-specialty' 'Craft-repair' 'Adm-clerical'
 'Exec-managerial' 'Tech-support' 'Sales' 'Priv-house-serv'
 'Transport-moving' 'Handlers-cleaners' 'Armed-Forces']

* relationship: ['Own-child' 'Husband' 'Not-in-family' 'Unmarried' 'Wife' 'Other-relative']

* race: ['Black' 'White' 'Asian-Pac-Islander' 'Other' 'Amer-Indian-Eskimo']

* gender: ['Male' 'Female']

* capital-gain: [    0  7688  3103  6418  7298  3908 14084  5178 15024 99999  2597  2907
  4650  6497  1055  5013 27828  4934  4064  3674  2174 10605  3418   114
  2580  3411  4508  4386  8614 13550  6849  2463  3137  2885  2964  1471
 10566  2354  1424  1455  3325  4416 25236   594  2105  4787  2829   401
  4865  1264  1506 10520  3464  2653 20051  4101  1797  2407  3471  1086
  1848 14344  1151  2993  2290 15020  9386  2202  3818  2176  5455 11678
  7978  7262  6514 41310  3456  7430  2414  2062 34095  1831  6723  5060
 15831  2977  2346  3273  2329  9562  2635  4931  1731  6097   914  7896
  5556  1409  3781  3942  2538  3887 25124  7443  5721  1173  4687  6612
  6767  2961   991  2036  2936  2050  1111  2228 22040  3432  6360  2009
  1639 18481  2387]

* capital-loss: [   0 1721 1876 2415 1887  625 1977 2057 1429 1590 1485 2051 2377 1672
 1628 1902 1602 1741 2444 1408 2001 2042 1740 1825 1848 1719 3004 2179
 1573 2205 1258 2339 1726 2258 1340 1504 2559 1668 1974 1980 1564 2547
 2002 1669 1617  323 3175 2472 2174 1579 2129 1510 1735 2282 1870 1411
 1911 1651 1092 1762 2457 2231 2238  653 1138 2246 2603 2392 1944 1380
 2465 1421 3770 1594  213 2149 2824 1844 2467 2163 1816 1648 2206 2352
  419 1539  880  810  974 4356 2489 1755 3683 2267 2080  155 3900 2201
 2754]

* hours-per-week: [40 50 30 32 10 39 35 48 25 20 45 47  6 43 90 54 60 38 36 18 24 44 56 28
 16 41 22 55 14 33 37  8 12 70 15 75 52 84 42 80 68 99 65  5 17 72 53 29
 96 21 46  3  1 23 49 67 76  7  2 58 26 34  4 51 78 63 31 92 77 27 85 13
 19 98 62 66 57 11 86 59  9 64 73 61 88 79 89 74 69 87 97 94 82 91 81 95]

* native-country: ['United-States' '?' 'Peru' 'Guatemala' 'Mexico' 'Dominican-Republic'
 'Ireland' 'Germany' 'Philippines' 'Thailand' 'Haiti' 'El-Salvador'
 'Puerto-Rico' 'Vietnam' 'South' 'Columbia' 'Japan' 'India' 'Cambodia'
 'Poland' 'Laos' 'England' 'Cuba' 'Taiwan' 'Italy' 'Canada' 'Portugal'
 'China' 'Nicaragua' 'Honduras' 'Iran' 'Scotland' 'Jamaica' 'Ecuador'
 'Yugoslavia' 'Hungary' 'Hong' 'Greece' 'Trinadad&Tobago'
 'Outlying-US(Guam-USVI-etc)' 'France' 'Holand-Netherlands']

* income: ['<=50K' '>50K']

In [11]:
dataset.duplicated().sum()

52

## Data Cleaning

After the short descriptive data analysis, it turns out that: 
- the dataset has 52 duplicate rows
- some missing values denoted by "?"

As "educational-num" vs "education" and "marital-status" vs "relationship" convey the similar information, it is better to drop one of them. I decided to drop "education" as we can avoid from the curse of dimensionality and we do not need to do one-hot encoder for it. I decided to drop "relationship column" as it is similar to "marital-status" and also conveys some information about "gender".

I also dropped the duplicate values and missed values denoted as "?".

In [12]:
dataset

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [13]:
dataset1 = dataset.drop(['education', 'relationship'], axis = 1)
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   educational-num  48842 non-null  int64
 4   marital-status   48842 non-null  object
 5   occupation       48842 non-null  object
 6   race             48842 non-null  object
 7   gender           48842 non-null  object
 8   capital-gain     48842 non-null  int64
 9   capital-loss     48842 non-null  int64
 10  hours-per-week   48842 non-null  int64
 11  native-country   48842 non-null  object
 12  income           48842 non-null  object
dtypes: int64(6), object(7)
memory usage: 4.8+ MB

In [14]:
dataset1 = dataset1.drop_duplicates().reset_index(drop = True)

In [15]:
for column in dataset1.columns:
    print(f"{column}: {sum(dataset1[column]=='?')}")

age: 0
workclass: 2794
fnlwgt: 0
educational-num: 0
marital-status: 0
occupation: 2804
race: 0
gender: 0
capital-gain: 0
capital-loss: 0
hours-per-week: 0
native-country: 856
income: 0

In [16]:
missed_value = "?"
columns_to_check = ['workclass', 'occupation', 'native-country']

mask = dataset1[columns_to_check].apply(lambda x: x == '?').any(axis=1)
dataset1 = dataset1.drop(index=dataset1[mask].index)

Now lets merge some categorical variables to reduce them.
For example, there are some variables in workclass column (Local-gov, Federal-gov, State-gov), which in general means a government job.

In [17]:
dataset1["workclass"].unique()

array(['Private', 'Local-gov', 'Self-emp-not-inc', 'Federal-gov',
       'State-gov', 'Self-emp-inc', 'Without-pay'], dtype=object)

In [18]:
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Local-gov', 'Government', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Federal-gov', 'Government', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'State-gov', 'Government', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Self-emp-inc', 'Self-emp', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Self-emp-not-inc', 'Self-emp', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Without-pay', 'Others', dataset1['workclass'])
dataset1['workclass'] = np.where(dataset1['workclass'] == 'Private', 'Others', dataset1['workclass'])

In [19]:
dataset1["workclass"].unique()

array(['Others', 'Government', 'Self-emp'], dtype=object)

In [20]:
dataset1["marital-status"].unique()

array(['Never-married', 'Married-civ-spouse', 'Widowed', 'Separated',
       'Divorced', 'Married-spouse-absent', 'Married-AF-spouse'],
      dtype=object)

In [21]:
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Never-married', 'Single', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Married-civ-spouse', 'Married', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Widowed', 'Single', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Separated', 'Single', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Divorced', 'Single', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Married-spouse-absent', 'Married', dataset1['marital-status'])
dataset1['marital-status'] = np.where(dataset1['marital-status'] == 'Married-AF-spouse', 'Married', dataset1['marital-status'])

In [22]:
dataset1["marital-status"].unique()

array(['Single', 'Married'], dtype=object)

In [23]:
dataset1['occupation'].unique()

array(['Machine-op-inspct', 'Farming-fishing', 'Protective-serv',
       'Other-service', 'Prof-specialty', 'Craft-repair', 'Adm-clerical',
       'Exec-managerial', 'Tech-support', 'Sales', 'Priv-house-serv',
       'Transport-moving', 'Handlers-cleaners', 'Armed-Forces'],
      dtype=object)

In [24]:
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Machine-op-inspct', 'Blue Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Farming-fishing', 'Blue Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Craft-repair', 'Blue Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Transport-moving', 'Blue Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Handlers-cleaners', 'Blue Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Priv-house-serv', 'Blue Collar', dataset1['occupation'])

dataset1['occupation'] = np.where(dataset1['occupation'] == 'Protective-serv', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Armed-Forces', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Adm-clerical', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Exec-managerial', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Prof-specialty', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Tech-support', 'White Collar', dataset1['occupation'])
dataset1['occupation'] = np.where(dataset1['occupation'] == 'Sales', 'White Collar', dataset1['occupation'])

dataset1['occupation'] = np.where(dataset1['occupation'] == 'Other-service', 'Others', dataset1['occupation'])

In [25]:
dataset1['occupation'].unique()

array(['Blue Collar', 'White Collar', 'Others'], dtype=object)

In [26]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45164 entries, 0 to 48777
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              45164 non-null  int64
 1   workclass        45164 non-null  object
 2   fnlwgt           45164 non-null  int64
 3   educational-num  45164 non-null  int64
 4   marital-status   45164 non-null  object
 5   occupation       45164 non-null  object
 6   race             45164 non-null  object
 7   gender           45164 non-null  object
 8   capital-gain     45164 non-null  int64
 9   capital-loss     45164 non-null  int64
 10  hours-per-week   45164 non-null  int64
 11  native-country   45164 non-null  object
 12  income           45164 non-null  object
dtypes: int64(6), object(7)
memory usage: 4.8+ MB

In [27]:
dataset1.head(5)

,age,workclass,fnlwgt,educational-num,marital-status,occupation,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Others,226802,7,Single,Blue Collar,Black,Male,0,0,40,United-States,<=50K
1,38,Others,89814,9,Married,Blue Collar,White,Male,0,0,50,United-States,<=50K
2,28,Government,336951,12,Married,White Collar,White,Male,0,0,40,United-States,>50K
3,44,Others,160323,10,Married,Blue Collar,Black,Male,7688,0,40,United-States,>50K
5,34,Others,198693,6,Single,Others,White,Male,0,0,30,United-States,<=50K

# Synthetic and original dataset split

In [28]:
X = dataset1.drop('income', axis = 1)
Y = dataset1['income']

test_size = round(len(X) * 33 /100)
test_size

X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=test_size, random_state=32)

original_dataset = pd.concat([X_test, y_test], axis=1)
synthetic_dataset = pd.concat([X_train, y_train], axis=1)

In [33]:
original_dataset.to_csv("original_test_dataset/adult_original_test.csv", index=False)
synthetic_dataset.to_csv("original_train_dataset/adult_original_train.csv", index=False)

In [30]:
len(original_dataset)

14904

In [31]:
len(synthetic_dataset)

30260